# RT-DETR-l + P2 小目标检测头
# 改动：在 Head 中加入 P2/4 尺度特征，RTDETRDecoder 从 3 尺度扩展到 4 尺度
# 原版只用 P3/P4/P5（stride 8/16/32），加 P2 后覆盖 stride=4（4×4 像素目标）
# 参考：Drone-DETR (PMC 2024), 煤矿小目标检测 (Scientific Reports 2025)

nc: 1
scales:
  l: [1.00, 1.00, 1024]

backbone:
  - [-1, 1, HGStem, [32, 48]]                        # 0-P2/4
  - [-1, 6, HGBlock, [48, 128, 3]]                   # 1 (P2 features)

  - [-1, 1, DWConv, [128, 3, 2, 1, False]]            # 2-P3/8
  - [-1, 6, HGBlock, [96, 512, 3]]                    # 3 (P3 features)

  - [-1, 1, DWConv, [512, 3, 2, 1, False]]            # 4-P4/16
  - [-1, 6, HGBlock, [192, 1024, 5, True, False]]
  - [-1, 6, HGBlock, [192, 1024, 5, True, True]]
  - [-1, 6, HGBlock, [192, 1024, 5, True, True]]      # 7 (P4 features)

  - [-1, 1, DWConv, [1024, 3, 2, 1, False]]           # 8-P5/32
  - [-1, 6, HGBlock, [384, 2048, 5, True, False]]     # 9 (P5 features)

head:
  # ====== P5 处理 ======
  - [-1, 1, Conv, [256, 1, 1, None, 1, 1, False]]     # 10 input_proj for P5
  - [-1, 1, AIFI, [1024, 8]]                          # 11 Transformer encoder
  - [-1, 1, Conv, [256, 1, 1]]                        # 12 Y5

  # ====== P4 融合 ======
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]        # 13
  - [7, 1, Conv, [256, 1, 1, None, 1, 1, False]]      # 14 input_proj for P4
  - [[-2, -1], 1, Concat, [1]]                        # 15
  - [-1, 3, RepC3, [256]]                             # 16 fpn P4
  - [-1, 1, Conv, [256, 1, 1]]                        # 17 Y4

  # ====== P3 融合 ======
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]        # 18
  - [3, 1, Conv, [256, 1, 1, None, 1, 1, False]]      # 19 input_proj for P3
  - [[-2, -1], 1, Concat, [1]]                        # 20
  - [-1, 3, RepC3, [256]]                             # 21 fpn P3 (X3)

  # ====== P2 融合（新增！）======
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]        # 22
  - [1, 1, Conv, [256, 1, 1, None, 1, 1, False]]      # 23 input_proj for P2 ← NEW
  - [[-2, -1], 1, Concat, [1]]                        # 24
  - [-1, 3, RepC3, [256]]                             # 25 fpn P2 (X2) ← NEW

  # ====== Bottom-up PAN ======
  - [-1, 1, Conv, [256, 3, 2]]                        # 26 downsample P2→P3
  - [[-1, 21], 1, Concat, [1]]                        # 27
  - [-1, 3, RepC3, [256]]                             # 28 pan P3 (F3)

  - [-1, 1, Conv, [256, 3, 2]]                        # 29 downsample P3→P4
  - [[-1, 17], 1, Concat, [1]]                        # 30
  - [-1, 3, RepC3, [256]]                             # 31 pan P4 (F4)

  - [-1, 1, Conv, [256, 3, 2]]                        # 32 downsample P4→P5
  - [[-1, 12], 1, Concat, [1]]                        # 33
  - [-1, 3, RepC3, [256]]                             # 34 pan P5 (F5)

  # ====== 4 尺度 Decoder ======
  - [[25, 28, 31, 34], 1, RTDETRDecoder, [nc]]        # RTDETRDecoder(P2, P3, P4, P5) ← 4 scales!
