# YOLOv8n with P2 head (stride=4) for tiny crack detection
# 关键改动：
#   1. Neck 增加一条路径，上采样到 stride=4 尺度（P2 特征）
#   2. Detect head 从 [P3, P4, P5] 改为 [P2, P3, P4, P5]
#   3. 最小可检测目标从 ~8x8 降到 ~4x4 像素
nc: 1

scales:
  n: [0.33, 0.25, 1024]

# Backbone（不变）
backbone:
  - [-1, 1, Conv, [64, 3, 2]]   # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4
  - [-1, 3, C2f, [128, True]]   # 2
  - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8
  - [-1, 6, C2f, [256, True]]   # 4
  - [-1, 1, Conv, [512, 3, 2]]  # 5-P4/16
  - [-1, 6, C2f, [512, True]]   # 6
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 3, C2f, [1024, True]]  # 8
  - [-1, 1, SPPF, [1024, 5]]    # 9

# Head with P2 branch
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 10
  - [[-1, 6], 1, Concat, [1]]                   # 11 cat P4
  - [-1, 3, C2f, [512]]                         # 12

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 13
  - [[-1, 4], 1, Concat, [1]]                   # 14 cat P3
  - [-1, 3, C2f, [256]]                         # 15 (P3/8-small)

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 16
  - [[-1, 2], 1, Concat, [1]]                   # 17 cat P2
  - [-1, 3, C2f, [128]]                         # 18 (P2/4-xsmall) ← P2 HEAD！

  - [-1, 1, Conv, [128, 3, 2]]                  # 19
  - [[-1, 15], 1, Concat, [1]]                  # 20
  - [-1, 3, C2f, [256]]                         # 21 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]                  # 22
  - [[-1, 12], 1, Concat, [1]]                  # 23
  - [-1, 3, C2f, [512]]                         # 24 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]                  # 25
  - [[-1, 9], 1, Concat, [1]]                   # 26
  - [-1, 3, C2f, [1024]]                        # 27 (P5/32-large)

  - [[18, 21, 24, 27], 1, Detect, [nc]]         # Detect(P2, P3, P4, P5)
